Revit 2024 API
MEPSupportUtils.CreateDuctworkStiffener Method
 Create family based stiffener on the specified fabrication ductwork.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static FamilyInstance CreateDuctworkStiffener(
	Document document,
	ElementId familySymbolId,
	ElementId hostId,
	double distanceFromHostEnd
)
Visual Basic
Public Shared Function CreateDuctworkStiffener ( _
	document As Document, _
	familySymbolId As ElementId, _
	hostId As ElementId, _
	distanceFromHostEnd As Double _
) As FamilyInstance
Visual C++
public:
static FamilyInstance^ CreateDuctworkStiffener(
	Document^ document,
	ElementId^ familySymbolId,
	ElementId^ hostId,
	double distanceFromHostEnd
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
familySymbolId
Type: Autodesk.Revit.DB.ElementId
 The id of a stiffener FamilySymbol.
hostId
Type: Autodesk.Revit.DB.ElementId
 The id of the host ductwork.
distanceFromHostEnd
Type: System.Double
 The distance from the host primary end to place the hosted instance. Units are in feet (ft).
Return Value
 The new stiffener family instance.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document. -or- familySymbolId is not a valid Element identifier. -or- hostId is not a valid Element identifier. -or- Invalid familySymbolId for stiffeners. -or- Host is not a straight ductwork.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The distance from host primary end is out of range.
Autodesk.Revit.Exceptions.InvalidOperationException |  The profiles of family symbol and host are mismatch.
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
Autodesk.Revit.Exceptions.RegenerationFailedException |  Failed to create stiffener due to document regenerate error.
See Also
MEPSupportUtils Class
Autodesk.Revit.DB Namespace